<!-- terraform-plan:dev -->
## terraform-plan (dev)

**Plan: 1 to add, 0 to change, 0 to destroy.**

<details>
<summary>Show full plan output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_domain_mapping.api[0] will be created
  + resource "google_cloud_run_domain_mapping" "api" {
      + id       = (known after apply)
      + location = "europe-west1"
      + name     = "api.develop.genshin.dungeon.studio"
      + project  = "dungeon-studio-genshin-dev"
      + status   = (known after apply)

      + metadata {
          + effective_annotations = (known after apply)
          + effective_labels      = {
              + "goog-terraform-provisioned" = "true"
            }
          + generation            = 0
          + namespace             = "dungeon-studio-genshin-dev"
          + resource_version      = (known after apply)
          + self_link             = (known after apply)
          + terraform_labels      = {
              + "goog-terraform-provisioned" = "true"
            }
          + uid                   = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "api"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>